var o=['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30'];
//var main=['हफ्ता','साल','आज','कल','कैलेंडर','सेकंड','घंटा','मिनट','बजे','घड़ी','सकना','करना','जाना','आना','हसना','बनाना','देखना','दूर','छोटा','सुंदर','बदसूरत','कठिन','अच्छा','आदमी','आप','आशा','और','एक','कमरा','कुरसी','खिड़की','गाड़ी','गुजराती','चाचा','चिड़िया','छोटा','जर्मन','जापानी','ठीक','तीन','तुम','तू','दादी','दूसरा','दो','नहीं','पंखा','पिता','पुराना','बड़ा','बहुत','बहू','बूढ़ा','भारतीय','मकान','माता','मानव','यह','रविवार','राजा','लाल','लोग','वह','हम','हवादार','है','अभी','आज','और','कितना','किताब']
var hindi_dict=['एक',' दो','तीन','चार','पांच','छह','सात','आठ','नौ','दस','ग्यारह','बारह','तेरह','चौदह','पंद्रह','सोलह','सत्रह','अठारह','उन्नीस','बीस','इकीस','बाईस','तेइस','चौबीस','पच्चीस','छब्बीस','सताइस','अट्ठाइस','उनतीस','तीस'];
//var main = ['बाधाम','चौलाई','सेब','बेल','केले','काली बेरी','लौकी','बैंगन','पत्ता गोबी',' गाजर','शिताफल','अंगूर','अमरूद','कटहल','जामुन','आम']

var telugu = ['అ','ఆ','ఇ','ఈ','ఉ','ఊ','ఋ','ఎ','ఏ','ఐ','ఒ','ఓ','ఖ','గ','ఘ','ఙ','చ','ఛ','జ','ఞ','ట','ఠ','డ','ఢ','ణ','త','థ','ద','ధ','న','ప','ఫ','బ','భ','మ','య','ర','ఱ','ల','ళ','వ','శ','ష','స','హ'];
//var telugu_dict = ['వారం','ఇయర్','నేడు','రేపు','నిజమె','కాదు','ఏంటి','ఆంగ్లము','ఎల','ఎక్కడ','ఎప్పుడు','ఎవరు','ఏది','ఎంత','ఎన్ని','వద్దు','లేదు','కాదు','రాదు','బాలేదు','తెలియదు','నాకు','కాలేదు','భాష','నాపేరు','ఉంది','ఎలా','ఉన్నారు','ఎక్కడికి','ఏంటి','ఎక్కడ','ఎందుకు','ఎవరు','ఎలా','ఏమి','ఉంది','లేదు','నాకు','కావాలి','మాసం','సంవత్సరం','మాసం','తేది','నూతన','ఇది','చాలా','బాగుంది','మీరు','ఎక్కడ','నను','సినిమా','చూస్తున్నాను','ఉంది','తరువు','తరవండి','అవును','నాకోసం','మీకోసం','నకోసం','కాదు','అవును','ఎంత','కాలేదు','నాకు','సున్న','ఒక','రెండు','మూడు','నాలుగు','ఐదు','ఆరు','ఏడు','ఎనిమిది','తొమ్మిది','పది','పదకొందు','పన్నెండు','పదమూడు','పద్నాలుగు','పదిహేను','పదహారు','పదిహేడు','పద్దెనిమిది','పంతొమ్మిది','ఇరవై','ఇరవైఒకటి','ఇరవైరెండు','ఇరవైమూడు','నలబై','వంద' ,'వెయ్యి','రెండువేలు','కోటి','సగం','ముందు','ఉదయం','రాత్రి','ఒక','గంటలు','ఒక్క','క్షణం','నిమిషాలు','గంటలు','రోజు','వారం','నెల','రోజు' ,'నేడు','నేడు','రేపు','ఈవారం','గత','వారం','వారం','ఆది','సోమ','మంగళ','బుధ','గురు','శుక్ర','శని','మాఘము','ఆషాఢము','రంగు','నలుపు'];
var telugu_dict =['ఒక్కటి','రెండు','మూడు','నాలుగు','ఐదు','ఆరు','ఏడు','ఎనిమిది','తొమ్మిది','పది','పదకొండు','పన్నెండు','పదమూడు ','పధ్నాలుగు','పదిహేను','పదహారు','పదిహేడు','పద్దెనిమిది','పందొమ్మిది','ఇరవై','ఇరవై ఒక్కటి','ఇరవై రెండు','ఇరవై మూడు','ఇరవై నాలుగు','ఇరవై ఐదు','ఇరవై ఆరు','ఇరవై ఏడు','ఇరవై ఎనిమిది','ఇరవై తొమ్మిది','ముప్పై '];
//var telugu_dict =['బాధం','అమర్నాథ్','ఆపిల్','మేడి పండు','అరటి పండు','నల్ల రేగు పండు','సొరకాయ','వంకాయ','క్యాబేజీ','క్యారెట్',' సీత ఫలం','ద్రాక్ష','జామ పండు','పనస పండు','నేరేడి పండు','మామిడి']
var getElementId=[11,12,13,14,15,21,22,23,24,25,31,32,33,34,35,41,42,43,44,45,51,52,53,54,55];
var mainarray=o[0];
console.log(mainarray);
var z,x,y,X,Y,Z;
var word='';
function restart()
{
var l ;
for(l=1;l<=5;l++)
{
		document.getElementById("1"+l).innerHTML = o[l-1]; 
	
}
for(l=1,z=5;l<=5;l++,z++)
{
		document.getElementById("2"+l).innerHTML = o[z]; 
}
for(l=1,y=10;l<=5;l++,y++)
{
		document.getElementById("3"+l).innerHTML = o[y];
		//y++; 
	
}
for(l=1,x=15;l<=5;l++,x++)
{
	//var x=15;
		document.getElementById("4"+l).innerHTML = o[x];
	//	x++; 
	
}
for(l=1,Z=20;l<=5;l++,Z++)
{
	//var Z=20;

		document.getElementById("5"+l).innerHTML = o[Z];
	//	Z++; 
	
}
for(l=1,Y=25;l<=5;l++,Y++)
{
	//var Y=25;
		document.getElementById("6"+l).innerHTML = o[Y];
	//	Y++; 
	
}
}

function getdata(a)
{
	document.getElementById("1"+a).innerHTML=hindi_dict[a-1]+' '+'='+telugu_dict[a-1];
}
function getdata1(a)
{
	document.getElementById("2"+a).innerHTML=hindi_dict[a+4]+' '+'='+telugu_dict[a+4];
}
function getdata2(a)
{
	document.getElementById("3"+a).innerHTML=hindi_dict[a+9]+' '+'='+telugu_dict[a+9];
}

function getdata3(a)
{
	document.getElementById("4"+a).innerHTML=hindi_dict[a+14]+' '+'='+telugu_dict[a+14];
}
function getdata4(a)
{
	document.getElementById("5"+a).innerHTML=hindi_dict[a+19]+' '+'='+telugu_dict[a+19];
}
function getdata5(a)
{
	document.getElementById("6"+a).innerHTML=hindi_dict[a+24]+' '+'='+telugu_dict[a+24];
}
